Tekla Open API Reference for Tekla Structures 2025
AABB.Addition Operator (AABB, AABB)
 Combines (adds) the given two axis-aligned 3d bounding boxes.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static AABB operator +(
	AABB AABB1,
	AABB AABB2
)
Public Shared Operator + (
	AABB1 As AABB,
	AABB2 As AABB
) As AABB
Parameters
AABB1
Type: Tekla.Structures.Geometry3d.AABB
The first axis-aligned 3d bounding box to combine.
AABB2
Type: Tekla.Structures.Geometry3d.AABB
The second axis-aligned 3d bounding box to combine.
Return Value
Type: AABB
The new combined axis-aligned 3d bounding box.
See Also
Reference
AABB Class
Addition Overload
Tekla.Structures.Geometry3d Namespace